zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/LPC54114/LPC54114_cm4.xml
        <register>
          <name>SYSRSTSTAT</name>
          <description>System reset status register</description>
          <addressOffset>0x1F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>POR</name>
              <description>POR reset status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_POR_DETECTED</name>
                  <description>No POR detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_DETECTED</name>
                  <description>POR detected. Writing a one clears this reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTRST</name>
              <description>Status of the external RESET pin. External reset status</description>
              <bitOffset>0x1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_RESET_DETECTED</name>
                  <description>No reset event detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET_DETECTED</name>
                  <description>Reset detected. Writing a one clears this reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDT</name>
              <description>Status of the Watchdog reset</description>
              <bitOffset>0x2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_WDT_RESET_DETECTED</name>
                  <description>No WDT reset detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDT_RESET_DETECTED</name>
                  <description>WDT reset detected. Writing a one clears this reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOD</name>
              <description>Status of the Brown-out detect reset</description>
              <bitOffset>0x3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_BOD_RESET_DETECTED</name>
                  <description>No BOD reset detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOD_RESET_DETECTED</name>
                  <description>BOD reset detected. Writing a one clears this reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSRST</name>
              <description>Status of the software system reset</description>
              <bitOffset>0x4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_SYSTEM_RESET_DETECTED</name>
                  <description>No System reset detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSTEM_RESET_DETECTED</name>
                  <description>System reset detected. Writing a one clears this reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBCLKCTRL0</name>
          <description>AHB Clock control n</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x18A</resetValue>
          <resetMask>0xCFCED9A</resetMask>
          <fields>
            <field>
              <name>ROM</name>
              <description>Enables the clock for the Boot ROM. 0 = Disable; 1 = Enable.</description>
              <bitOffset>0x1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM1</name>
              <description>Enables the clock for SRAM1. 0 = Disable; 1 = Enable.</description>
              <bitOffset>0x3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM2</name>
              <description>Enables the clock for SRAM2. 0 = Disable; 1 = Enable.</description>
              <bitOffset>0x4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH</name>
              <description>Enables the clock for the flash controller. 0 = Disable; 1 = Enable. This clock is needed for flash programming, not for flash read.</description>
              <bitOffset>0x7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMC</name>
              <description>Enables the clock for the Flash accelerator. 0 = Disable; 1 = Enable. This clock is needed if the flash is being read.</description>
              <bitOffset>0x8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUTMUX</name>
              <description>Enables the clock for the input muxes. 0 = Disable; 1 = Enable.</description>
              <bitOffset>0xB</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IOCON</name>
              <description>Enables the clock for the IOCON block. 0 = Disable; 1 = Enable.</description>
              <bitOffset>0xD</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO0</name>
              <description>Enables the clock for the GPIO0 port registers. 0 = Disable; 1 = Enable.</description>
              <bitOffset>0xE</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO1</name>
              <description>Enables the clock for the GPIO1 port registers. 0 = Disable; 1 = Enable.</description>
              <bitOffset>0xF</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PINT</name>
              <description>Enables the clock for the pin interrupt block.0 = Disable; 1 = Enable.</description>
              <bitOffset>0x12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GINT</name>
              <description>Enables the clock for the grouped pin interrupt block. 0 = Disable; 1 = Enable.</description>
              <bitOffset>0x13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA0</name>
              <description>Enables the clock for the DMA0 controller. 0 = Disable; 1 = Enable.</description>
              <bitOffset>0x14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC</name>
              <description>Enables the clock for the CRC engine. 0 = Disable; 1 = Enable.</description>
              <bitOffset>0x15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WWDT</name>
              <description>Enables the clock for the Watchdog Timer. 0 = Disable; 1 = Enable.</description>
              <bitOffset>0x16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTC</name>
              <description>Enables the bus clock for the RTC. 0 = Disable; 1 = Enable.</description>
              <bitOffset>0x17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAILBOX</name>
              <description>Enables the clock for the Mailbox. 0 = Disable; 1 = Enable. Present on selected devices</description>
              <bitOffset>0x1A</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC0</name>
              <description>Enables the clock for the ADC0 register interface. 0 = Disable; 1 = Enable.</description>
              <bitOffset>0x1B</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBCLKCTRL1</name>
          <description>AHB Clock control n</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xE4FFC05</resetMask>
          <fields>
            <field>
              <name>MRT0</name>
              <description>Enables the clock for the Multi-Rate Timer. 0 = Disable; 1 = Enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCT0</name>
              <description>Enables the clock for SCT0. 0 = Disable; 1 = Enable.</description>
              <bitOffset>0x2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UTICK0</name>
              <description>Enables the clock for the Micro-tick Timer. 0 = Disable; 1 = Enable.</description>
              <bitOffset>0xA</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXCOMM0</name>
              <description>Enables the clock for Flexcomm 0. 0 = Disable; 1 = Enable.</description>
              <bitOffset>0xB</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXCOMM1</name>
              <description>Enables the clock for Flexcomm 1. 0 = Disable; 1 = Enable.</description>
              <bitOffset>0xC</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXCOMM2</name>
              <description>Enables the clock for Flexcomm 2. 0 = Disable; 1 = Enable.</description>
              <bitOffset>0xD</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXCOMM3</name>
              <description>Enables the clock for Flexcomm 3. 0 = Disable; 1 = Enable.</description>
              <bitOffset>0xE</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXCOMM4</name>
              <description>Enables the clock for Flexcomm 4. 0 = Disable; 1 = Enable.</description>
              <bitOffset>0xF</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXCOMM5</name>
              <description>Enables the clock for Flexcomm 5. 0 = Disable; 1 = Enable.</description>
              <bitOffset>0x10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXCOMM6</name>
              <description>Enables the clock for Flexcomm 6. 0 = Disable; 1 = Enable.</description>
              <bitOffset>0x11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXCOMM7</name>
              <description>Enables the clock for Flexcomm 7. 0 = Disable; 1 = Enable.</description>
              <bitOffset>0x12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMIC0</name>
              <description>Enables the clock for the digital microphone interface. 0 = Disable; 1 = Enable.</description>
              <bitOffset>0x13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTIMER2</name>
              <description>Enables the clock for CTIMER 2. 0 = Disable; 1 = Enable.</description>
              <bitOffset>0x16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB0</name>
              <description>Enables the clock for the USB0 interface. 0 = Disable; 1 = Enable.</description>
              <bitOffset>0x19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTIMER0</name>
              <description>Enables the clock for timer CTIMER0. 0 = Disable; 1 = Enable.</description>
              <bitOffset>0x1A</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTIMER1</name>
              <description>Enables the clock for timer CTIMER1. 0 = Disable; 1 = Enable.</description>
              <bitOffset>0x1B</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>AHBCLKCTRLSET[%s]</name>
          <description>Set bits in AHBCLKCTRLn</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>CLK_SET</name>
              <description>Writing ones to this register sets the corresponding bit or bits in the AHBCLKCTRLn register, if they are implemented. Bits that do not correspond to defined bits in AHBCLKCTRLn are reserved and only zeroes should be written to them.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>AHBCLKCTRLCLR[%s]</name>
          <description>Clear bits in AHBCLKCTRLn</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>CLK_CLR</name>
              <description>Writing ones to this register clears the corresponding bit or bits in the AHBCLKCTRLn register, if they are implemented. Bits that do not correspond to defined bits in AHBCLKCTRLn are reserved and only zeroes should be written to them.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAINCLKSELA</name>
          <description>Main clock source select A</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Clock source for main clock source selector A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRO_12_MHZ</name>
                  <description>FRO 12 MHz (fro_12m)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKIN</name>
                  <description>CLKIN (clk_in)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WATCHDOG_OSCILLATOR</name>
                  <description>Watchdog oscillator (wdt_clk)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRO_HF</name>
                  <description>FRO 96 or 48 MHz (fro_hf)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MAINCLKSELB</name>
          <description>Main clock source select B</description>
          <addressOffset>0x284</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Clock source for main clock source selector B. Selects the clock source for the main clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAINCLKSELA</name>
                  <description>MAINCLKSELA. Use the clock source selected in MAINCLKSELA register.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSTEM_PLL_OUTPUT</name>
                  <description>System PLL output (pll_clk)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_OSC_OUTPUT</name>
                  <description>RTC oscillator 32 kHz output (32k_clk)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKOUTSELA</name>
          <description>CLKOUT clock source select A</description>
          <addressOffset>0x288</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>CLKOUT clock source selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAIN_CLOCK</name>
                  <description>Main clock (main_clk)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKIN</name>
                  <description>CLKIN (clk_in)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WATCHDOG_OSCILLATOR</name>
                  <description>Watchdog oscillator (wdt_clk)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRO_HF</name>
                  <description>FRO 96 or 48 MHz (fro_hf)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSTEM_PLL_OUTPUT</name>
                  <description>PLL output (pll_clk)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRO_12_MHZ</name>
                  <description>FRO 12 MHz (fro_12m)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_OSC_OUTPUT</name>
                  <description>RTC oscillator 32 kHz output (32k_clk)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None, this may be selected in order to reduce power when no output is needed.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
