zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/LPC54114/LPC54114_cm4.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="CTIMER0">
      <name>CTIMER3</name>
      <description>LPC5411x Standard counter/timers (CTIMER0 to 4)</description>
      <groupName>CTIMER</groupName>
      <baseAddress>0x40048000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x78</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CTIMER3</name>
        <value>13</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="CTIMER0">
      <name>CTIMER4</name>
      <description>LPC5411x Standard counter/timers (CTIMER0 to 4)</description>
      <groupName>CTIMER</groupName>
      <baseAddress>0x40049000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x78</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CTIMER4</name>
        <value>37</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>SPIFI0</name>
      <description>LPC5411x SPI Flash Interface (SPIFI)</description>
      <groupName>SPIFI</groupName>
      <baseAddress>0x40080000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SPIFI0</name>
        <value>39</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>SPIFI control register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x400FFFFF</resetValue>
          <resetMask>0xF8EFFFFF</resetMask>
          <fields>
            <field>
              <name>TIMEOUT</name>
              <description>This field contains the number of serial clock periods without the processor reading data in memory mode, which will cause the SPIFI hardware to terminate the command by driving the CS pin high and negating the CMD bit in the Status register. (This allows the flash memory to enter a lower-power state.) If the processor reads data from the flash region after a time-out, the command in the Memory Command Register is issued again.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSHIGH</name>
              <description>This field controls the minimum CS high time, expressed as a number of serial clock periods minus one.</description>
              <bitOffset>0x10</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>D_PRFTCH_DIS</name>
              <description>This bit allows conditioning of memory mode prefetches based on the AHB HPROT (instruction/data) access information. A 1 in this register means that the SPIFI will not attempt a speculative prefetch when it encounters data accesses.</description>
              <bitOffset>0x15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTEN</name>
              <description>If this bit is 1 when a command ends, the SPIFI will assert its interrupt request output. See INTRQ in the status register for further details.</description>
              <bitOffset>0x16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE3</name>
              <description>SPI Mode 3 select.</description>
              <bitOffset>0x17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCK_LOW</name>
                  <description>SCK LOW. The SPIFI drives SCK low after the rising edge at which the last bit of each command is captured, and keeps it low while CS is HIGH.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCK_HIGH</name>
                  <description>SCK HIGH. the SPIFI keeps SCK high after the rising edge for the last bit of each command and while CS is HIGH, and drives it low after it drives CS LOW. (Known serial flash devices can handle either mode, but some devices may require a particular mode for proper operation.) MODE3, RFCLK, and FBCLK should not all be 1, because in this case there is no final falling edge on SCK on which to sample the last data bit of the frame.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRFTCH_DIS</name>
              <description>Cache prefetching enable. The SPIFI includes an internal cache. A 1 in this bit disables prefetching of cache lines.</description>
              <bitOffset>0x1B</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable. Cache prefetching enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable. Disables prefetching of cache lines.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DUAL</name>
              <description>Select dual protocol.</description>
              <bitOffset>0x1C</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QUAD</name>
                  <description>Quad protocol. This protocol uses IO3:0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL</name>
                  <description>Dual protocol. This protocol uses IO1:0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RFCLK</name>
              <description>Select active clock edge for input data.</description>
              <bitOffset>0x1D</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RISING_EDGE</name>
                  <description>Rising edge. Read data is sampled on rising edges on the clock, as in classic SPI operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING_EDGE</name>
                  <description>Falling edge. Read data is sampled on falling edges of the clock, allowing a full serial clock of of time in order to maximize the serial clock frequency. MODE3, RFCLK, and FBCLK should not all be 1, because in this case there is no final falling edge on SCK on which to sample the last data bit of the frame.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FBCLK</name>
              <description>Feedback clock select.</description>
              <bitOffset>0x1E</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERNAL_CLOCK</name>
                  <description>Internal clock. The SPIFI samples read data using an internal clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FEEDBACK_CLOCK</name>
                  <description>Feedback clock. Read data is sampled using a feedback clock from the SCK pin. This allows slightly more time for each received bit. MODE3, RFCLK, and FBCLK should not all be 1, because in this case there is no final falling edge on SCK on which to sample the last data bit of the frame.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAEN</name>
              <description>A 1 in this bit enables the DMA Request output from the SPIFI. Set this bit only when a DMA channel is used to transfer data in peripheral mode. Do not set this bit when a DMA channel is used for memory-to-memory transfers from the SPIFI memory area. DMAEN should only be used in Command mode.</description>
              <bitOffset>0x1F</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD</name>
          <description>SPIFI command register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATALEN</name>
              <description>Except when the POLL bit in this register is 1, this field controls how many data bytes are in the command. 0 indicates that the command does not contain a data field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POLL</name>
              <description>This bit should be written as 1 only with an opcode that a) contains an input data field, and b) causes the serial flash device to return byte status repetitively (e.g., a Read Status command). When this bit is 1, the SPIFI hardware continues to read bytes until the test specified by the DATALEN field is met. The hardware tests the bit in each status byte selected by DATALEN bits 2:0, until a bit is found that is equal to DATALEN bit 3. When the test succeeds, the SPIFI captures the byte that meets this test so that it can be read from the Data Register, and terminates the command by raising CS. The end-of-command interrupt can be enabled to inform software when this occurs</description>
              <bitOffset>0xE</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DOUT</name>
              <description>If the DATALEN field is not zero, this bit controls the direction of the data:</description>
              <bitOffset>0xF</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>Input from serial flash.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT</name>
                  <description>Output to serial flash.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTLEN</name>
              <description>This field controls how many intermediate bytes precede the data. (Each such byte may require 8 or 2 SCK cycles, depending on whether the intermediate field is in serial, 2-bit, or 4-bit format.) Intermediate bytes are output by the SPIFI, and include post-address control information, dummy and delay bytes. See the description of the Intermediate Data register for the contents of such bytes.</description>
              <bitOffset>0x10</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIELDFORM</name>
              <description>This field controls how the fields of the command are sent.</description>
              <bitOffset>0x13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALL_SERIAL</name>
                  <description>All serial. All fields of the command are serial.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DUAL_DATA</name>
                  <description>Quad/dual data. Data field is quad/dual, other fields are serial.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SERIAL_OPCODE</name>
                  <description>Serial opcode. Opcode field is serial. Other fields are quad/dual.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL_QUAD_DUAL</name>
                  <description>All quad/dual. All fields of the command are in quad/dual format.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRAMEFORM</name>
              <description>This field controls the opcode and address fields.</description>
              <bitOffset>0x15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPCODE</name>
                  <description>Opcode. Opcode only, no address.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPCODE_1_BYTE</name>
                  <description>Opcode one byte. Opcode, least significant byte of address.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPCODE_2_BYTES</name>
                  <description>Opcode two bytes. Opcode, two least significant bytes of address.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPCODE_3_BYTES</name>
                  <description>Opcode three bytes. Opcode, three least significant bytes of address.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPCODE_4_BYTES</name>
                  <description>Opcode four bytes. Opcode, 4 bytes of address.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_OPCODE_3_BYTES</name>
                  <description>No opcode three bytes. No opcode, 3 least significant bytes of address.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_OPCODE_4_BYTES</name>
                  <description>No opcode four bytes. No opcode, 4 bytes of address.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPCODE</name>
              <description>The opcode of the command (not used for some FRAMEFORM values).</description>
              <bitOffset>0x18</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR</name>
          <description>SPIFI address register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>Address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDATA</name>
          <description>SPIFI intermediate data register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDATA</name>
              <description>Value of intermediate bytes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLIMIT</name>
          <description>SPIFI limit register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLIMIT</name>
              <description>Zero-based upper limit of cacheable memory</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA</name>
          <description>SPIFI data register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Input or output data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
