zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/LPC54114/LPC54114_cm4.xml
        <register>
          <name>MCMD</name>
          <description>SPIFI memory command register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFC000</resetMask>
          <fields>
            <field>
              <name>POLL</name>
              <description>This bit should be written as 0.</description>
              <bitOffset>0xE</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DOUT</name>
              <description>This bit should be written as 0.</description>
              <bitOffset>0xF</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTLEN</name>
              <description>This field controls how many intermediate bytes precede the data. (Each such byte may require 8 or 2 SCK cycles, depending on whether the intermediate field is in serial, 2-bit, or 4-bit format.) Intermediate bytes are output by the SPIFI, and include post-address control information, dummy and delay bytes. See the description of the Intermediate Data register for the contents of such bytes.</description>
              <bitOffset>0x10</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIELDFORM</name>
              <description>This field controls how the fields of the command are sent.</description>
              <bitOffset>0x13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALL_SERIAL</name>
                  <description>All serial. All fields of the command are serial.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DUAL_DATA</name>
                  <description>Quad/dual data. Data field is quad/dual, other fields are serial.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SERIAL_OPCODE</name>
                  <description>Serial opcode. Opcode field is serial. Other fields are quad/dual.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL_QUAD_DUAL</name>
                  <description>All quad/dual. All fields of the command are in quad/dual format.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRAMEFORM</name>
              <description>This field controls the opcode and address fields.</description>
              <bitOffset>0x15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPCODE</name>
                  <description>Opcode. Opcode only, no address.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPCODE_1_BYTE</name>
                  <description>Opcode one byte. Opcode, least-significant byte of address.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPCODE_2_BYTES</name>
                  <description>Opcode two bytes. Opcode, 2 least-significant bytes of address.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPCODE_3_BYTES</name>
                  <description>Opcode three bytes. Opcode, 3 least-significant bytes of address.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPCODE_4_BYTES</name>
                  <description>Opcode four bytes. Opcode, 4 bytes of address.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_OPCODE_3_BYTES</name>
                  <description>No opcode three bytes. No opcode, 3 least-significant bytes of address.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_OPCODE_4_BYTES</name>
                  <description>No opcode, 4 bytes of address.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPCODE</name>
              <description>The opcode of the command (not used for some FRAMEFORM values).</description>
              <bitOffset>0x18</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <description>SPIFI status register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2000000</resetValue>
          <resetMask>0xFF000033</resetMask>
          <fields>
            <field>
              <name>MCINIT</name>
              <description>This bit is set when software successfully writes the Memory Command register, and is cleared by Reset or by writing a 1 to the RESET bit in this register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD</name>
              <description>This bit is 1 when the Command register is written. It is cleared by a hardware reset, a write to the RESET bit in this register, or the deassertion of CS which indicates that the command has completed communication with the SPI Flash.</description>
              <bitOffset>0x1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET</name>
              <description>Write a 1 to this bit to abort a current command or memory mode. This bit is cleared when the hardware is ready for a new command to be written to the Command register.</description>
              <bitOffset>0x4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTRQ</name>
              <description>This bit reflects the SPIFI interrupt request. Write a 1 to this bit to clear it. This bit is set when a CMD was previously 1 and has been cleared due to the deassertion of CS.</description>
              <bitOffset>0x5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VERSION</name>
              <description>-</description>
              <bitOffset>0x18</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
