zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/LPC54114/LPC54114_cm4.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="SPI0">
      <name>SPI6</name>
      <alternatePeripheral>FLEXCOMM6</alternatePeripheral>
      <description>LPC5411x Serial Peripheral Interfaces (SPI)</description>
      <groupName>SPI</groupName>
      <baseAddress>0x40097000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xE44</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FLEXCOMM6</name>
        <value>20</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="USART0">
      <name>USART6</name>
      <alternatePeripheral>FLEXCOMM6</alternatePeripheral>
      <description>LPC5411x USARTs</description>
      <groupName>USART</groupName>
      <baseAddress>0x40097000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xE44</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FLEXCOMM6</name>
        <value>20</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="FLEXCOMM0">
      <name>FLEXCOMM7</name>
      <description>LPC5411x Flexcomm serial communication</description>
      <groupName>FLEXCOMM</groupName>
      <baseAddress>0x40098000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FLEXCOMM7</name>
        <value>21</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="I2C0">
      <name>I2C7</name>
      <alternatePeripheral>FLEXCOMM7</alternatePeripheral>
      <description>LPC5411x I2C-bus interfaces</description>
      <groupName>I2C</groupName>
      <baseAddress>0x40098000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x884</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FLEXCOMM7</name>
        <value>21</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="I2S0">
      <name>I2S1</name>
      <alternatePeripheral>FLEXCOMM7</alternatePeripheral>
      <description>LPC5411x I2S interface</description>
      <groupName>I2S</groupName>
      <baseAddress>0x40098000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xE48</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FLEXCOMM7</name>
        <value>21</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPI0">
      <name>SPI7</name>
      <alternatePeripheral>FLEXCOMM7</alternatePeripheral>
      <description>LPC5411x Serial Peripheral Interfaces (SPI)</description>
      <groupName>SPI</groupName>
      <baseAddress>0x40098000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xE44</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FLEXCOMM7</name>
        <value>21</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="USART0">
      <name>USART7</name>
      <alternatePeripheral>FLEXCOMM7</alternatePeripheral>
      <description>LPC5411x USARTs</description>
      <groupName>USART</groupName>
      <baseAddress>0x40098000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xE44</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FLEXCOMM7</name>
        <value>21</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>ADC0</name>
      <description>LPC5411x 12-bit ADC controller (ADC)</description>
      <groupName>ADC</groupName>
      <baseAddress>0x400A0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x74</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ADC0_SEQA</name>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>ADC0_SEQB</name>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>ADC0_THCMP</name>
        <value>24</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>ADC Control register. Contains the clock divide value, resolution selection, sampling time selection, and mode controls.</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x600</resetValue>
          <resetMask>0x7FFF</resetMask>
          <fields>
            <field>
              <name>CLKDIV</name>
              <description>In synchronous mode only, the system clock is divided by this value plus one to produce the clock for the ADC converter, which should be less than or equal to 72 MHz. Typically, software should program the smallest value in this field that yields this maximum clock rate or slightly less, but in certain cases (such as a high-impedance analog source) a slower clock may be desirable. This field is ignored in the asynchronous operating mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ASYNMODE</name>
              <description>Select clock mode.</description>
              <bitOffset>0x8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYNCHRONOUS_MODE</name>
                  <description>Synchronous mode. The ADC clock is derived from the system clock based on the divide value selected in the CLKDIV field. The ADC clock will be started in a controlled fashion in response to a trigger to eliminate any uncertainty in the launching of an ADC conversion in response to any synchronous (on-chip) trigger. In Synchronous mode with the SYNCBYPASS bit (in a sequence control register) set, sampling of the ADC input and start of conversion will initiate 2 system clocks after the leading edge of a (synchronous) trigger pulse.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCHRONOUS_MODE</name>
                  <description>Asynchronous mode. The ADC clock is based on the output of the ADC clock divider ADCCLKSEL in the SYSCON block.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESOL</name>
              <description>The number of bits of ADC resolution. Accuracy can be reduced to achieve higher conversion rates. A single conversion (including one conversion in a burst or sequence) requires the selected number of bits of resolution plus 3 ADC clocks. This field must only be altered when the ADC is fully idle. Changing it during any kind of ADC operation may have unpredictable results. ADC clock frequencies for various resolutions must not exceed: - 5x the system clock rate for 12-bit resolution - 4.3x the system clock rate for 10-bit resolution - 3.6x the system clock for 8-bit resolution - 3x the bus clock rate for 6-bit resolution</description>
              <bitOffset>0x9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESOLUTION_6_BIT</name>
                  <description>6-bit resolution. An ADC conversion requires 9 ADC clocks, plus any clocks specified by the TSAMP field.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESOLUTION_8_BIT</name>
                  <description>8-bit resolution. An ADC conversion requires 11 ADC clocks, plus any clocks specified by the TSAMP field.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESOLUTION_10_BIT</name>
                  <description>10-bit resolution. An ADC conversion requires 13 ADC clocks, plus any clocks specified by the TSAMP field.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESOLUTION_12_BIT</name>
                  <description>12-bit resolution. An ADC conversion requires 15 ADC clocks, plus any clocks specified by the TSAMP field.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BYPASSCAL</name>
              <description>Bypass Calibration. This bit may be set to avoid the need to calibrate if offset error is not a concern in the application.</description>
              <bitOffset>0xB</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CALIBRATE</name>
                  <description>Calibrate. The stored calibration value will be applied to the ADC during conversions to compensated for offset error. A calibration cycle must be performed each time the chip is powered-up. Re-calibration may be warranted periodically - especially if operating conditions have changed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYPASS_CALIBRATION</name>
                  <description>Bypass calibration. Calibration is not utilized. Less time is required when enabling the ADC - particularly following chip power-up. Attempts to launch a calibration cycle are blocked when this bit is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSAMP</name>
              <description>Sample Time. The default sampling period (TSAMP = '000') at the start of each conversion is 2.5 ADC clock periods. Depending on a variety of factors, including operating conditions and the output impedance of the analog source, longer sampling times may be required. See Section 28.7.10. The TSAMP field specifies the number of additional ADC clock cycles, from zero to seven, by which the sample period will be extended. The total conversion time will increase by the same number of clocks. 000 - The sample period will be the default 2.5 ADC clocks. A complete conversion with 12-bits of accuracy will require 15 clocks. 001- The sample period will be extended by one ADC clock to a total of 3.5 clock periods. A complete 12-bit conversion will require 16 clocks. 010 - The sample period will be extended by two clocks to 4.5 ADC clock cycles. A complete 12-bit conversion will require 17 ADC clocks. 111 - The sample period will be extended by seven clocks to 9.5 ADC clock cycles. A complete 12-bit conversion will require 22 ADC clocks.</description>
              <bitOffset>0xC</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INSEL</name>
          <description>Input Select. Allows selection of the temperature sensor as an alternate input to ADC channel 0.</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Selects the input source for channel 0. All other values are reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC0_IN0</name>
                  <description>ADC0_IN0 function.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEMPERATURE_SENSOR</name>
                  <description>Internal temperature sensor.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
